app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY created_at DESC
---
	def index
		@posts = Post.all.order("created_at DESC")

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Test"], ["content", "Premier text"], ["created_at", "2018-06-04 15:26:02.469091"], ["updated_at", "2018-06-04 15:26:02.469091"]]
---
	def create
		@post = Post.new(post_params)

		if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "Premier text lol"], ["updated_at", "2018-06-05 08:17:57.357316"], ["id", 1]]
---
	def update
		@post = Post.find(params[:id])


		if @post.update (post_params)